app/views/posts/show.html.erb

	<header><h2>Comments: </h2></header>
	<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 31