app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def show
    @comment = Comment.find(params[:id])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def edit
    @comment = Comment.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 30 LIMIT 1
INSERT INTO `comments` (`body`, `created_at`, `email`, `name`, `post_id`, `updated_at`) VALUES ('Super Cool Beans', '2013-01-14 21:31:29', 'rawkamatic@gmail.com', 'Hunter J', NULL, '2013-01-14 21:31:29')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])

   respond_to do |format|
      if @comment.save